20_acossiation-has_many-belongs_to/app/controllers/items_controller.rb

  def create
    item_params = params.require(:item).permit(:name, :description, :price, :real, :weight)
    p item_params
    @item = Item.create(item_params)
---
INSERT INTO "items" ("name", "description", "price", "real", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "roman"], ["description", "good car"], ["price", 50000.0], ["real", "t"], ["weight", 0.0], ["created_at", "2016-06-02 21:58:56.639932"], ["updated_at", "2016-06-02 21:58:56.639932"]]

  def update
    item_params = params.require(:item).permit(:name, :description, :price, :real, :weight)
    p item_params
    @item.update_attributes(item_params)
---
UPDATE "items" SET "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", 333.0], ["updated_at", "2016-06-05 19:55:46.003126"], ["id", 15]]

  def upvote
    @item.increment!(:votes_count)
---
UPDATE "items" SET "votes_count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["votes_count", 1], ["updated_at", "2016-06-05 21:43:48.974803"], ["id", 5]]

  def expensive
    @items  = Item.where("price > 1000")
---
SELECT "items".* FROM "items" WHERE (price > 1000)

  def find_item
    @item = Item.where(id: params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]